# (2) 고양이
# 		* 특징/속성/성질/외형 : 품종, 털색상, 눈색상, 무게,나이,성별,이름
# 		* 행동/기능/동작 : 앉기, 잠자기, 뛰기

# from 모듈명 import 클래스명, 함수명

from Animal import Animal



class Cat2(Animal):
	def __init__(self,kind, coat_color, eye_color,weight,age,gender, name):

		# 부모생성
		super().__init__(kind,coat_color,eye_color,weight,age,gender,name)
		print('Cat2__init__()')

	def tailing(self):
		print(f'{self.name} 기분이 나빠서 꼬리친다.')

	def bark(self):
		print(f'{self.name} 야옹')

	def site(self):
		print(f'{self.name} 앉는다.')
	

	def 식빵(self):
		print('''
		                   /
                        _,.------....___,.' ',.-.
                     ,-'          _,.--"        |
                   ,'         _.-'              .
                  /   ,     ,'                   `
                 .   /     /                     ``.
                 |  |     .                       \.\\
       ____      |___._.  |       __               \ `.
     .'    `---""       ``"-.--"'`  \               .  \\
    .  ,            __               `              |   .
    `,'         ,-"'  .               \             |    L
   ,'          '    _.'                -._          /    |
  ,`-.    ,".   `--'                      >.      ,'     |
 . .'\'   `-'       __    ,  ,-.         /  `.__.-      ,'
 ||:, .           ,'  ;  /  / \ `        `.    .      .'/
 j|:D  \          `--'  ' ,'_  . .         `.__, \   , /
/ L:_  |                 .  "' :_;                `.'.'
.    ""'                  """""'                    V
 `.                                 .    `.   _,..  `
   `,_   .    .                _,-'/    .. `,'   __  `
    ) \`._        ___....----"'  ,'   .'  \ |   '  \  .
   /   `. "`-.--"'         _,' ,'     `---' |    `./  |
  .   _  `""'--.._____..--"   ,             '         |
  | ." `. `-.                /-.           /          ,
  | `._.'    `,_            ;  /         ,'          .
 .'          /| `-.        . ,'         ,           ,
 '-.__ __ _,','    '`-..___;-...__   ,.'\ ____.___.'
 `"^--'..'   '-`-^-'"--    `-^-'`.''"""""`.,^.`.--' 	

''')
		print(f'{self.name}가 식빵을 굽는다.')




