# -----------------------------------------------------------------------------
#	강아지 데이터를 표현/ 저장하는 클래스 정의/설계
# ------------------------------------------------------------------------------
#	* 특징/속성/성질/외형 : 품종, 털색상, 눈색상, 무게, 나이, 성별, 이름
#	* 행동/기능/동작	 : 짖는다, 문다, 꼬리친다, 죽는척하기(x - 특별한 강아지)
# ------------------------------------------------------------------------------

# 클래스 이름 : Dog
# 부모클래스 : Animal => 
# 클래소 속성 :kind , coat_color, eye_color, weight age, gender, name
# 클래스기능  : brak(),bite(), tailling() 

# ------------------------------------------------------------------------------

class Dog:
	# 객체 즉, 인스턴스 생성 시 Dog 마다 속성 저장해주는 메서드
	# 파이썬 시스템에 의해서 실행되는 메서드 : 콜백, 메서드/함수
	def __init__(self,kind, coat_color, eye_color,weight,age,gender, name):
		print('Dog___init__()', self)
		self.kind = kind
		self.coat_color = coat_color
		self.eye_color = eye_color
		self.weight = weight
		self.age = age
		self.gender = gender
		self.name = name
	
	# 메소드 이름 : brak()
	# 매개변수들  : 없음
	# 메서드 결과 : 없음 
	def bark(self):
		print(f'{self.name}멍 멍')

	# 메서드 이름 : bite
	# 매개변수들 : 무엇을 what
	# 매서드결과 : 없음
	def bite(self,what):
		print(f'{self.name} 가 {what}을/를 물고 있다.')

# -------------------------------------------------------------------------------
# 		객체 생성하기
# 	-생성 메서드 이름 : 클래스 이름 () ---> 클래스 내부의 __ init__() 호출
# -------------------------------------------------------------------------------


myDog = Dog('차우차우','검은색','검은색','20','2','남자','차우')
print(id(myDog))

# --------------------------------------------------------------------------------
#	객체의 속성과 메서드 사용하기
# 	-[속성 읽기] 객체변수명.속성명
#	-[속성 변경] 객체변수명.속성명 = 새로운 값
# 	-[메서드 호출] 객체변수명.메서드명()
# ---------------------------------------------------------------------------------

myDog.bark()
myDog.bite('도둑')

print(myDog.age)
myDog.age =3
print(myDog.age)

msg = 'Good Luck'
print(msg.upper()) 


# (2) 고양이
# 		* 특징/속성/성질/외형 : 품종, 털색상, 눈색상, 무게,나이,성별,이름
# 		* 행동/기능/동작 : 앉기, 잠자기, 뛰기

class Cat(Dog):
	def bark(self):
		print(f'{self.name} 야옹')

	def site(self):
		print(f'{self.name} 앉는다.')
	
	def 식빵(self):
		print('''
		                   /
                        _,.------....___,.' ',.-.
                     ,-'          _,.--"        |
                   ,'         _.-'              .
                  /   ,     ,'                   `
                 .   /     /                     ``.
                 |  |     .                       \.\\
       ____      |___._.  |       __               \ `.
     .'    `---""       ``"-.--"'`  \               .  \\
    .  ,            __               `              |   .
    `,'         ,-"'  .               \             |    L
   ,'          '    _.'                -._          /    |
  ,`-.    ,".   `--'                      >.      ,'     |
 . .'\'   `-'       __    ,  ,-.         /  `.__.-      ,'
 ||:, .           ,'  ;  /  / \ `        `.    .      .'/
 j|:D  \          `--'  ' ,'_  . .         `.__, \   , /
/ L:_  |                 .  "' :_;                `.'.'
.    ""'                  """""'                    V
 `.                                 .    `.   _,..  `
   `,_   .    .                _,-'/    .. `,'   __  `
    ) \`._        ___....----"'  ,'   .'  \ |   '  \  .
   /   `. "`-.--"'         _,' ,'     `---' |    `./  |
  .   _  `""'--.._____..--"   ,             '         |
  | ." `. `-.                /-.           /          ,
  | `._.'    `,_            ;  /         ,'          .
 .'          /| `-.        . ,'         ,           ,
 '-.__ __ _,','    '`-..___;-...__   ,.'\ ____.___.'
 `"^--'..'   '-`-^-'"--    `-^-'`.''"""""`.,^.`.--' 	

''')
		print(f'{self.name}가 식빵을 굽는다.')



nabi = Cat('들고양이','검은색','노란색','3kg',2,'남','나비')

print(nabi.bark(),nabi.식빵(),nabi.site())


