# -----------------------------------------------------------------------------
#	강아지 데이터를 표현/ 저장하는 클래스 정의/설계
# ------------------------------------------------------------------------------
#	* 특징/속성/성질/외형 : 품종, 털색상, 눈색상, 무게, 나이, 성별, 이름
#	* 행동/기능/동작	 : 짖는다, 문다, 꼬리친다, 죽는척하기(x - 특별한 강아지)
# ------------------------------------------------------------------------------

# 클래스 이름 : Dog2
# 부모클래스 : Animal => 
# 클래소 속성 :kind , coat_color, eye_color, weight age, gender, name
# 클래스기능  : brak(),bite(), tailling() 

# ------------------------------------------------------------------------------

from Animal import Animal

class Dog2(Animal):
	def __init__(self, kind, coat_color, eye_color, weight, age, gender, name):
		# 부모 클래스의 __init__을 올바르게 호출
		super().__init__(kind, coat_color, eye_color, weight, age, gender, name)
		print('Dog2 __init__()')

	def bark(self):
		print(f'{self.name}멍멍')

	# 메서드 이름 : bite
	# 매개변수들 : 무엇을 what
	# 매서드결과 : 없음
	def bite(self,what):
		print(f'{self.name} 가 {what}을/를 물고 있다.')

# -------------------------------------------------------------------------------
# 		객체 생성하기
# 	-생성 메서드 이름 : 클래스 이름 () ---> 클래스 내부의 __ init__() 호출
# -------------------------------------------------------------------------------




