# ---------------------------------------------------
#  모듈 로딩
# ---------------------------------------------------
# 

from Cat2 import *
from Dog2 import *


# ----------------------------------------------------------
# 객체생성
# ---------------------------------------------------------
myDog = Dog2('똥개','흰색','검은색',2.5,1,'남자','자루')
yourDog = Dog2('치와와','검은색','검은색',1.5,0.8,'여자','깐순이')

myCat = Cat2('들고양이','흰색','검은색',2.5,1,'남자','나비')
yourCat = Cat2('아비시니안','갈색','노란색',4.5,5,'남자','아비')


# 몸무게 변경
myCat.weight = 3.3

print(myDog.tailing())
print(myCat.tailing())