# --------------------------------------------------------------
#   제어문 - for ~ in 반복문
#   
# --------------------------------------------------------------

# --------------------------------------------------------------
# [실습] Good Luck 이라는 문자열에서 대문자는 소문자로 
#   소문자는 대문자로 출력해 주세요.
# [출력] Good Luck => gOOOD iUCK
# --------------------------------------------------------------


msg = "Good Luck"

print(msg, end= ' => ')
for num in msg :

    if num.isupper() :
        print(num.lower(), end='')
      
    else:
        print(num.upper(), end='')

print()

# --------------------------------------------------------------
# [실습] Good Luck 이라는 문자열에서 대문자는 소문자로 
#   소문자는 대문자로 변환후 저장하세요.
# [출력] Good Luck => gOOOD iUCK
# --------------------------------------------------------------



msg = "Good Luck"

print('[변환전]',msg)


for m in msg :

    if m.isupper() :
        # print(m.lower(), end='')
        msg = msg.replace(m ,m.lower(),1)
      
    else:
        msg = msg.replace(m ,m.upper(),1)

        

print('[변환후]',msg)
