# ---------------------------------------------------------------------------
#   4칙 연산 계산기
#   - 기능 : 덧셈, 뺄셈, 곱셈, 나눗셈
#   - 구현 : 기능을 함수로 구현
# ---------------------------------------------------------------------------


# -------------------------------------------------------------
# 함수이름: 
#   기능
#   매개변수
#   결과값
#--------------------------------------------------------------


def cal(r, num1, num2):
    num1 = int(num1)
    num2 = int(num2)
    if r == '+':
        
        print(f'{num1}+{num2} : {num1+num2}')

    elif r =="-":
        print(f'{num1}-{num2} : {num1-num2}')

    elif r =="*":
        print(f'{num1}*{num2} : {num1*num2}')
    elif   r =='/'  and num2:
        print(f'{num1}/{num2} : {num1/num2}')
    else:
        print("잘못된 값입니다.")


cal("+",5,9)
cal("-",5,9)
cal("4",5,9)

# 함수 호출/사용 => 매개변수와 실제 데이터 갯수 동일해야함
# 매개변수 = 실제데이터 저장
cal("4",5,9,5)



