# ------------------------------------------------------------
# 함수 이름 : printMenu
# 매개 변수 : 없음
# 반 환 값 : 없음
# ------------------------------------------------------------

# def printMenu():
    

# ------------------------------------------------------------
# 함수 이름 : InputData
# 매개 변수 : msg - 입력 요청 메세지, sep - 구분자
# 반 환 값 :입력 받은 데이터
# ------------------------------------------------------------

def inputData(msg, sep):
    nums = input(msg).strip()
    numList=nums.split(sep)
    numList=[int(num) for num in numList]
    return numList

# ------------------------------------------------------------


# ------------------------------------------------------------
# 함수 이름 : calc
# 함수 기능 : 2개 데이터와 연산자 입력 받아 계산 후 결과 반환
# 매개 변수 : num1, num2, op
# 반 환 값 : 연산 결과
# ------------------------------------------------------------

def calc(num1, num2, op):
    if op == '+':
        return num1+num2