# ----------------------------------------------------------------
#   행 인덱스 & 열 이름 일부 변경하기
#   - 메서드 rename()
# ----------------------------------------------------------------
# 모듈로딩
#-----------------------------------------------------------------

import pandas as pd

# ----------------------------------------------------------------
#   데이터 준비
# ----------------------------------------------------------------

data = [[17,'남','덕영고'],[15,'여','대구중']]

# ----------------------------------------------------------------
#   데이터 프레임 생성
# ----------------------------------------------------------------

dataDF1 = pd.DataFrame(data)

# 현재 index, columns 속성 출력

print(dataDF1.index)
print(dataDF1.columns)

# -----------------------------------------------------------------
# 데이터프레임의 인덱스와 컬럼명 설정
# -----------------------------------------------------------------

# - 인덱스 -> 학생1, 학생2
# - 컬럼즈 -> 연령, 성별,학교


dataDF1.index = ['학생1','학생2']
dataDF1.columns = ['연령','성별','학교']

print(dataDF1)

# -인덱스 => 학생1 => 학생01
# -컬럼즈 => 연령 => 나이
dataDF1.rename(index={'학생1':'학생01'})
dataDF2 = dataDF1.rename(index={'학생1':'학생01'})

print('dataDF2------',dataDF2)
print('dataDF1------',dataDF1)

dataDF3=dataDF1.rename(columns={'연령':'나이'}, inplace=True)
print('dataDF3------',dataDF3)
print('dataDF1------',dataDF1)