# ----------------------------------------------------------------
#   행 인덱스 & 열 삭제
#   - 메서드 : drop()
#   * axic 매개변수 : 삭제 방향 axis =0 행, axis=1 열
#   * inplace 매개변수 : True 원본변경, False 새로운 DF
# ----------------------------------------------------------------
# 모듈로딩
#-----------------------------------------------------------------

import pandas as pd

# ----------------------------------------------------------------
#   데이터 준비
# ----------------------------------------------------------------

data = [[17,'남','덕영고'],
        [15,'여','대구중'],
        [17,'남','덕영고'],
        [19,'남','덕영고'],
        [15,'남','덕영고']
        ]

# ----------------------------------------------------------------
#   데이터 프레임 생성
# ----------------------------------------------------------------

dataDF1 = pd.DataFrame(data)

# 현재 index, columns 속성 출력

print(dataDF1.index)
print(dataDF1.columns)
print(dataDF1)
# -----------------------------------------------------------------
# 데이터프레임의 인덱스와 컬럼명 설정
# -----------------------------------------------------------------

# - 인덱스 -> 학생1, 학생2
# - 컬럼즈 -> 연령, 성별,학교


# dataDF1.index = ['학생1','학생2','학생3','학생4','학생5']
# dataDF1.columns = ['연령','성별','학교']

print(dataDF1)

# -----------------------------------------------------------------
#  행 삭제 => drop(행인덱스, axis=0, inplace=False)
#             drop(행인덱스, axis='index', inplace=False)
# -----------------------------------------------------------------
# -0 번행 삭제 단, 원본 변경X

dataDF2 = dataDF1.drop(0)

print('dataDF2-----',dataDF2)
print('dataDF1-----',dataDF1)
# 0번행,3번행 삭제 단, 원본 변경X
dataDF3=dataDF1.drop([0,3])
print('dataDF3-----',dataDF3)
print('dataDF1-----',dataDF1)
# -----------------------------------------------------------------
#  열 삭제  => drop(행인덱스, axis=1, inplace=False)
#              drop(행인덱스, axis='columns', inplace=False)
# -----------------------------------------------------------------
# - 1번 영 삭제 단, 원본 변경X
dataDF2 = dataDF1.drop(0,axis=1)
print('dataDF2-----',dataDF2)
print('dataDF1-----',dataDF1)

# - 0번 2번 열 삭제, 원본 변경O
dataDF3 = dataDF1.drop([0,2],axis=1, inplace=True)
print('dataDF3-----',dataDF3)
print('dataDF1-----',dataDF1)

# ----------------------------------------------------------------
#   데이터 프레임 생성
# ----------------------------------------------------------------