# ----------------------------------------------------------------
#   행 인덱스 & 열 삭제
#   - 메서드 : drop()
#   * axic 매개변수 : 삭제 방향 axis =0 행, axis=1 열
#   * inplace 매개변수 : True 원본변경, False 새로운 DF
# ----------------------------------------------------------------
# 모듈로딩
#-----------------------------------------------------------------

import pandas as pd

# ----------------------------------------------------------------
#   데이터 준비
# ----------------------------------------------------------------

data = [[17,'남','덕영고'],
        [15,'여','대구중'],
        [17,'남','덕영고'],
        [19,'남','덕영고'],
        [15,'남','덕영고']
        ]

# ----------------------------------------------------------------
#   데이터 프레임 생성
# ----------------------------------------------------------------

dataDF1 = pd.DataFrame(data)

# 현재 index, columns 속성 출력

print(dataDF1.index)
print(dataDF1.columns)

# -----------------------------------------------------------------
# 데이터프레임의 인덱스와 컬럼명 설정
# -----------------------------------------------------------------

# - 인덱스 -> 학생1, 학생2
# - 컬럼즈 -> 연령, 성별,학교


dataDF1.index = ['학생1','학생2','학생3','학생4','학생5']
dataDF1.columns = ['연령','성별','학교']

print(dataDF1)

# -----------------------------------------------------------------
#  행 삭제
# -----------------------------------------------------------------
# 학생1 행 삭제

# 학생2, 학생4 행 삭제 그리고 원본 적용
dataDF4=dataDF1.drop(['학생2','학생4'], inplace=True)
print(dataDF4)
print(dataDF1)


dataDF2=dataDF1.drop('학생1',axis=0)
print(f'[dataDF1]------\n{dataDF1}')
print(f'[dataDF2]------\n{dataDF2}')



dataDF3=dataDF1.drop('학생1',axis='index')
print(f'[dataDF1]------\n{dataDF1}')
print(f'[dataDF2]------\n{dataDF2}')


# -----------------------------------------------------------------
#  열 삭제
# -----------------------------------------------------------------
# - 성별 컬럼 삭제

dataDF2=dataDF1.drop("성별",axis=1) 
dataDF3=dataDF1.drop("성별",axis='columns') 


# -연령, 학교 컬럼 삭제 ==> [컬럼1, 컬럼2,...., 컬럼n]
dataDF2=dataDF1.drop(['연령','학교'],axis=1) 
print(f'\n\n[dataDF1]--------\n{dataDF1}')
print(f'[dataDF2]--------\n{dataDF2}')






# ----------------------------------------------------------------
#   데이터 프레임 생성
# ----------------------------------------------------------------