# ----------------------------------------------------------------------------------
#   DataFrame에서 속성 읽기 & 변경하기
# ----------------------------------------------------------------------------------
#  모듈 로딩 -----------------------------------------------------------------------
import pandas  as pd

data = [[17,'남','덕영고'],[15,'여','대구중']]
dataDF = pd.DataFrame(data)
# 전역변수 -------------------------------------------------------------------------
# data = {'홍':[17,'남','덕영고'],
#         '마':[15,'여','대구중']}

# 데이터 프레임의 속성 읽기 -------------------------

print(f"index: {dataDF.index}")
print(f"index: {dataDF.columns}")

# 데이터 프레임 만들기 -------------------------------
# - Dict 타입의 데이터 => DataFrame 생성
# - Key 가 컬럼식별자로 설정
# - Value 가 세로로 즉, 컬럼값으로 설정
# ---------------------------------------------------
#         |  홍   |   마   |
#     0   |  17   |   15   |
#     1   |  남   |   여   |
#     2   | 덕영고 | 대구중 |

# print('DataDF---\n',dataDF) 

dataDF2 = pd.DataFrame(data, index=['홍','마'],
                             columns=['나이','성별','학교'])
print('DataDF---\n',dataDF2) 

# 데이터 프레임의 속성 읽기 ---------------------------

print(f"index: {dataDF2.index}")
print(f"columns: {dataDF2.columns}")
print(f"values: {dataDF2.values, type(dataDF2.values)}",sep="\n")


# 데이터프레임의 속성 변경 --------------------------------
# - 컬럼 명 속성을 영어로 변경하고 변경
dataDF2.columns=['age','gender','school']
print(dataDF2)


# - 행 인덱스 속성을 영어로 변경
dataDF2.index=['H01',"M01"]
print(dataDF2)

# - 값 속성을 변경 ==> 불가
# dataDF2.values=[[19,'남','덕영고'],[20,'여','대구중']]