# -----------------------------------------------------------------------
#   list 자료형
#   - 다양한 종류의 여러 개의 데이터를 저장하는 타입
#   - 형         식 : [ 데이터1, 데이터2, ....., 데이터n]
#   - 원소/요소 식별 : 인덱스 => 슬라이싱
# -----------------------------------------------------------------------
# 리스트 인덱싱 (Indexing)

fruits = ['사과','딸기','바나나','키위','수박']
#           0       1     2      3     4
#           -5     -4    -3     -2    -1
# 원소/요소 읽어오기 => 변수명[인덱스번호]
# -'사과'

print(fruits[0], fruits[-5])


# -'키위'
print(fruits[3], fruits[-2])

# - '사과','수박'
print(fruits[0], fruits[4])
print(fruits[-5], fruits[-1])


# - '사과', '딸기' , '바나나'
print('인덱싱', fruits[0], fruits[1], fruits[2])
print('슬라이싱',fruits[0:3])



# 기말고사 6과목 점수 저장

jumsus =[98, 100, 77, 60, 40, 20]
print(jumsus[0], jumsus[1], jumsus[2])
print(jumsus[:])

# -짝수 번째 요소만 출력 => 2,4,6,8.....
print(jumsus[2::2])

# -3의배수 번째 요소만 출력 => 3,6,9.....
print(jumsus[3::3])