# --------------------------------------------------------------
# 리스트의 원소를 한개씩 모두 출력하세요.
# 반복문 X
# 반복문을 사용하면 더 편하다
# --------------------------------------------------------------

numlist = [11,22,33,44,55,66,77,88,99,100]

# 변수명[ 인덱스 ]
# print(len(numlist))
# print(numlist[0])
# print(numlist[1])
# print(numlist[2])
# print(numlist[3])
# print(numlist[4])
# print(numlist[5])
# print(numlist[6])
# print(numlist[7])
# print(numlist[8])
# print(numlist[9])

for i in numlist:
       print(i, end=', ')


# ----------------------------------------------------------------
# 메세지를 구성하는 원소를 한개씩 모두 출력하세요.
# ----------------------------------------------------------------

msg = "오늘은 좋은 날! 내일도 좋은 날!"

# print(len(msg))
# print(msg[0])
# print(msg[1])
# print(msg[2])
# print(msg[3])
# print(msg[4])
# print(msg[5])
# print(msg[6])
# print(msg[7])
# print(msg[8])
# print(msg[9])
# print(msg[10])
# print(msg[11])
# print(msg[12])
# print(msg[13])
# print(msg[14])
# print(msg[15])
# print(msg[16])
# print(msg[17])
# print(msg[18])


# ---------------------------------------------------------------------
#  제어문 - 반복문 : 동일하거나 유사한 코드를 여러번 작성 X 사용하는 문법
#      
#   - 종류 : for ~ in ,while
# ---------------------------------------------------------------------

# - 동일한 부분 : print(num_List[])
# - 다 른  부분 : 숫자 0, 1, ......, 9, 0~9숫자
# for 원소 저장변수명 in 여러개의 원소가 가진데이터 타입:
# 원소 저장 변수명 = 원소

for num in range(10):
#          ---(1)----
       print(num)  
#      ---(3)----


# ----------------------------------------------------------
# 리스트의 원소를 모두 'str' => 'int' 타입을 변경
# ----------------------------------------------------------

numlist = ['11','22','33']

print(numlist[0])
print(numlist[1])
print(numlist[2])


# -------------------------------------------------------------
#  제어문 - 반복문 : 동일하거나 유사한 코드를 여러번 작성 X
# 
#   - 종류 : for ~ in , while
# -------------------------------------------------------------


numlist = ['11','22','33']

for n in numlist:
       print(int(n))

for n in range(numlist):
    numlist[n] = int(numlist[n])
    print(int(n))




