# ------------------------------------------------------------------
# 입력
# 키보드를 통해서 입력 받는 내장 함수 input()
# -문법 : input("입력받고 싶은 메세지")
# -동작 : 키보드로 입력이 완료되면 즉, Enter키 입력하면 입력된 데이터가 컴퓨터로 전달됨
#        입력된 데이터가 컴퓨터/ input 함수로 전달받음
# ------------------------------------------------------------------

# 나이 입력 받기

age = input("나이?")

print(f" 당신은은 {age} 살 이군요!")

# 좋아하는 계절 입력 받기

season = input("좋아하는 계절:")

# 좋아하는 동물 입력 받기
animal = input("좋아하는 동물:")

print(f"당신은 {season} 을 좋아하시는 군요, {animal}를 좋아하시는군요")