# -------------------------------------------------------------------
# 화면/ 터미널 출력 기능 내장함수 print()
# - 사용법 : print(데이터), print(변수명)
# - 결과 : 모니터 화면 / 터미널에 출력
# ---------------------------------------------------------------------

# 좋아하는 계절 화면에 출력

print("겨울")


# 좋아하는 과일 메모리에 저장후 화면에 출력
fruits ='딸기'
print(fruits)




# -------------------------------------------------------------------
# 화면/ 터미널 출력 기능 내장함수 print()
# - 사용법 : print(데이터1, 데이터2...)
#           print(변수명1, 변수명2....)
# - 결과 : 모니터 화면 / 터미널에 출력
# ---------------------------------------------------------------------
# -이름과 성별 화면에 출력

print('홍길동')
print("남자")
print("홍길동, 남자")

# 이름과 성별 과 나이 화면에 출력

print("홍길동","남자",125)


# - 이름과 좋아하는 과일명 화면 출력

print('홍길동', fruits)