# -------------------------------------------------------------
#   dict 자료형 살펴보기
#   -특징 : 데이터를 식별하는 키 와 함께 저장
#           키로 데이터를 식별하기 때문에 인덱스 필요X
#   -형식 :{키1:값, 키2:값, 키3:값, ...., 키n:값}
# -------------------------------------------------------------

# [1] dict 데이터 생성

data1 ={}
data2 ={'홍길동':'대구', '마징가':'일본', '베트맨':'미국', '홍길동':'한양'}
data3 ={1:'홍길동', 2:'베트맨', '지역':'대구'}
data4 ={('홍길동','대구'):20,('홍길동','서울'):33}
data4 ={('홍길동','대구'):[30,50,60],('홍길동','서울'):[70,75,85]}
data5 ={('홍길동','대구'):{'국어':30,'영어':80},('홍길동','서울'):{'국어':30,'영어':80}}

# 데이터 정보 출력
print(f'data1 {type(data1)}  {len(data1)}개 {data1}')
print(f'data2 {type(data2)}  {len(data2)}개 {data2}')
print(f'data3 {type(data3)}  {len(data3)}개 {data3}')
print(f'data3 {type(data4)}  {len(data4)}개 {data4}')
print(f'data3 {type(data5)}  {len(data5)}개 {data5}')


